a = int(input("輸入月租費:"))
b = int(input("輸入通話時間:"))
if a == 186 :
    if (b*0.09 < 186):
        print("通話費為:",b*0.09)
    elif (186 <= b*0.09 < 372):
        print("通話費為:",b*0.09*0.9)
    elif (b*0.09 > 372):
        print("通話費為:",b*0.09*0.8)
elif a == 386 :
    if (b*0.08 < 386):
        print("通話費為:",round(b*0.08))
    elif (386 <= b*0.08 < 772):
        print("通話費為:",round(b*0.08*0.8))
    elif (b*0.08 > 772):
        print("通話費為:",round(b*0.08*0.7))
elif a == 586 :
    if (b*0.07 < 586):
        print("通話費為:",b*0.07)
    elif (586 <= b*0.07 < 1172):
        print("通話費為:",b*0.07*0.7)
    elif (b*0.07 > 1172):
        print("通話費為:",b*0.07*0.6)
elif a == 986:
    if (b*0.06 < 986):
        print("通話費為:",b*0.06)
    elif (986 <= b*0.06 < 1972):
        print("通話費為:",b*0.06*0.6)
    elif (b*0.06 > 1972):
        print("通話費為:",b*0.6*0.5)
